In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('Chocolate Sales.csv')

In [15]:
df.head()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,2022-01-04,5320.0,180
1,Van Tuxwell,India,85% Dark Bars,2022-08-01,7896.0,94
2,Gigi Bohling,India,Peanut Butter Cubes,2022-07-07,4501.0,91
3,Jan Morforth,Australia,Peanut Butter Cubes,2022-04-27,12726.0,342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,2022-02-24,13685.0,184

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3282 entries, 0 to 3281
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   3282 non-null   object
 1   Country        3282 non-null   object
 2   Product        3282 non-null   object
 3   Date           3282 non-null   datetime64[ns]
 4   Amount         3282 non-null   float64
 5   Boxes Shipped  3282 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 154.0+ KB

In [14]:
df['Date'] = pd.to_datetime(df['Date'], format='%d/%m/%Y')
df['Amount'] = df['Amount'].str.replace('$','').str.replace(',','').astype(float)

In [21]:
df.describe()

                                Date        Amount  Boxes Shipped
count                           3282   3282.000000    3282.000000
mean   2023-05-03 15:09:06.252284928   6030.338775     164.666971
min              2022-01-03 00:00:00      7.000000       1.000000
25%              2022-07-04 00:00:00   2521.495000      71.000000
50%              2023-05-11 00:00:00   5225.500000     137.000000
75%              2024-03-02 00:00:00   8556.842500     232.000000
max              2024-08-31 00:00:00  26170.950000     778.000000
std                              NaN   4393.980200     124.024736

In [22]:
df.columns

Index(['Sales Person', 'Country', 'Product', 'Date', 'Amount',
       'Boxes Shipped'],
      dtype='object')

In [27]:
print("Quantidade de vendedores:",df['Sales Person'].nunique())
print("Quantidade de países:",df['Country'].nunique())
print("Quantidade de produtos:",df['Product'].nunique())

Quantidade de vendedores: 25
Quantidade de países: 6
Quantidade de produtos: 22

In [36]:
pd.DataFrame(sorted(df['Country'].unique()),columns=['Country'])

       Country
0    Australia
1       Canada
2        India
3  New Zealand
4           UK
5          USA

In [37]:
pd.DataFrame(sorted(df['Sales Person'].unique()),columns=['Sales Person'])

           Sales Person
0        Andria Kimpton
1          Barr Faughny
2        Beverie Moffet
3           Brien Boise
4        Camilla Castle
5          Ches Bonnell
6        Curtice Advani
7   Dennison Crosswaite
8        Dotty Strutley
9          Gigi Bohling
10      Gunar Cockshoot
11         Husein Augar
12         Jan Morforth
13       Jehu Rudeforth
14          Kaine Padly
15     Karlen McCaffrey
16        Kelci Walkden
17      Madelene Upcott
18       Mallorie Waber
19       Marney O'Breen
20           Oby Sorrel
21  Rafaelita Blaksland
22      Roddy Speechley
23          Van Tuxwell
24       Wilone O'Kielt

In [38]:
pd.DataFrame(sorted(df['Product'].unique()),columns=['Product'])

                 Product
0         50% Dark Bites
1         70% Dark Bites
2          85% Dark Bars
3        99% Dark & Pure
4            After Nines
5           Almond Choco
6    Baker's Choco Chips
7   Caramel Stuffed Bars
8   Choco Coated Almonds
9          Drinking Coco
10               Eclairs
11      Fruit & Nut Bars
12    Manuka Honey Choco
13             Milk Bars
14       Mint Chip Choco
15          Orange Choco
16   Organic Choco Syrup
17   Peanut Butter Cubes
18       Raspberry Choco
19    Smooth Sliky Salty
20   Spicy Special Slims
21            White Choc